# Pandas introduction

In [3]:
import numpy as np
import pandas as pd

In [4]:
indices = ['a','b','c']
my_list = [10,20, 11]

dictionry_list = {'a':10,'b':20,'c':11}

In [5]:
pd.Series(data = my_list)

0    10
1    20
2    11
dtype: int64

In [6]:
x = pd.Series(data = my_list, index = indices)
x['a']

10

In [7]:
pd.Series(dictionry_list)

a    10
b    20
c    11
dtype: int64

In [6]:
# operation

In [9]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [10]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [12]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [13]:
'W X Y Z'.split()

['W', 'X', 'Y', 'Z']

In [14]:
from numpy.random import uniform

In [15]:
df = pd.DataFrame(uniform(0,1,(5,4)),
                  index = 'A B C D E'.split(),
                  columns='W X Y Z'.split())

In [17]:
df

          W         X         Y         Z
A  0.438682  0.022206  0.187614  0.127755
B  0.774036  0.463918  0.763159  0.550240
C  0.016533  0.325265  0.209743  0.989788
D  0.890378  0.187555  0.730105  0.703296
E  0.370536  0.159561  0.542168  0.227495

In [19]:
df['W']

A    0.438682
B    0.774036
C    0.016533
D    0.890378
E    0.370536
Name: W, dtype: float64

In [20]:
df.W

A    0.438682
B    0.774036
C    0.016533
D    0.890378
E    0.370536
Name: W, dtype: float64

In [16]:
type(df['W'])

pandas.core.series.Series

In [21]:
df[['W','Z']]

          W         Z
A  0.438682  0.127755
B  0.774036  0.550240
C  0.016533  0.989788
D  0.890378  0.703296
E  0.370536  0.227495

In [22]:
df['NEW'] = df['W'] + df['Y']
df

          W         X         Y         Z       NEW
A  0.438682  0.022206  0.187614  0.127755  0.626296
B  0.774036  0.463918  0.763159  0.550240  1.537195
C  0.016533  0.325265  0.209743  0.989788  0.226276
D  0.890378  0.187555  0.730105  0.703296  1.620483
E  0.370536  0.159561  0.542168  0.227495  0.912704

In [30]:
df.drop('A',axis=0)

          W         X         Y         Z       NEW
B  0.774036  0.463918  0.763159  0.550240  1.537195
C  0.016533  0.325265  0.209743  0.989788  0.226276
D  0.890378  0.187555  0.730105  0.703296  1.620483
E  0.370536  0.159561  0.542168  0.227495  0.912704

In [34]:
df.drop('NEW',axis=1)

          W         X         Y         Z
A  0.438682  0.022206  0.187614  0.127755
B  0.774036  0.463918  0.763159  0.550240
C  0.016533  0.325265  0.209743  0.989788
D  0.890378  0.187555  0.730105  0.703296
E  0.370536  0.159561  0.542168  0.227495

In [25]:
df.loc['A']

W      0.438682
X      0.022206
Y      0.187614
Z      0.127755
NEW    0.626296
Name: A, dtype: float64

In [26]:
df.iloc[2]

W      0.016533
X      0.325265
Y      0.209743
Z      0.989788
NEW    0.226276
Name: C, dtype: float64

In [27]:
df.loc['B','Y']

0.7631589824912116

In [28]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.438682  0.187614
B  0.774036  0.763159

In [35]:
df>0.5

       W      X      Y      Z    NEW
A  False  False  False  False   True
B   True  False   True   True   True
C  False  False  False   True  False
D   True  False   True   True   True
E  False  False   True  False   True

In [36]:
df[df>0.5]

          W   X         Y         Z       NEW
A       NaN NaN       NaN       NaN  0.626296
B  0.774036 NaN  0.763159  0.550240  1.537195
C       NaN NaN       NaN  0.989788       NaN
D  0.890378 NaN  0.730105  0.703296  1.620483
E       NaN NaN  0.542168       NaN  0.912704

In [37]:
df[df['W']>df['Y']]

          W         X         Y         Z       NEW
A  0.438682  0.022206  0.187614  0.127755  0.626296
B  0.774036  0.463918  0.763159  0.550240  1.537195
D  0.890378  0.187555  0.730105  0.703296  1.620483

In [39]:
df[(df['W']>0.1) & (df['Y'] > 0.7)]

          W         X         Y         Z       NEW
B  0.774036  0.463918  0.763159  0.550240  1.537195
D  0.890378  0.187555  0.730105  0.703296  1.620483

In [40]:
df.reset_index()

  index         W         X         Y         Z       NEW
0     A  0.438682  0.022206  0.187614  0.127755  0.626296
1     B  0.774036  0.463918  0.763159  0.550240  1.537195
2     C  0.016533  0.325265  0.209743  0.989788  0.226276
3     D  0.890378  0.187555  0.730105  0.703296  1.620483
4     E  0.370536  0.159561  0.542168  0.227495  0.912704

In [42]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [43]:
df['States'] = newind
df

          W         X         Y         Z       NEW States
A  0.438682  0.022206  0.187614  0.127755  0.626296     CA
B  0.774036  0.463918  0.763159  0.550240  1.537195     NY
C  0.016533  0.325265  0.209743  0.989788  0.226276     WY
D  0.890378  0.187555  0.730105  0.703296  1.620483     OR
E  0.370536  0.159561  0.542168  0.227495  0.912704     CO

In [44]:
df.set_index('States')

               W         X         Y         Z       NEW
States
CA      0.438682  0.022206  0.187614  0.127755  0.626296
NY      0.774036  0.463918  0.763159  0.550240  1.537195
WY      0.016533  0.325265  0.209743  0.989788  0.226276
OR      0.890378  0.187555  0.730105  0.703296  1.620483
CO      0.370536  0.159561  0.542168  0.227495  0.912704

In [51]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [46]:
df['col2'].unique()

array([444, 555, 666])

In [47]:
df['col2'].nunique()

3

In [48]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [49]:
def times2(x):
    return x*2

In [50]:
df['col2'] = df['col2'].apply(times2)
df

   col1  col2 col3
0     1   888  abc
1     2  1110  def
2     3  1332  ghi
3     4   888  xyz

In [52]:
df['col2'] = df['col2'].apply(lambda x:x*2)
df

   col1  col2 col3
0     1   888  abc
1     2  1110  def
2     3  1332  ghi
3     4   888  xyz

In [53]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [54]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [55]:
df.sort_values(by='col2') #inplace=False by default

   col1  col2 col3
0     1   888  abc
3     4   888  xyz
1     2  1110  def
2     3  1332  ghi

In [56]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [57]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [66]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [67]:
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [68]:
df.fillna('100')

  col1 col2 col3
0    1  100  abc
1    2  555  def
2    3  666  ghi
3  100  444  xyz

In [69]:
help(df.fillna)

Help on method fillna in module pandas.core.frame:

fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs) method of pandas.core.frame.DataFrame instance
    Fill NA/NaN values using the specified method.

    Parameters
    ----------
    value : scalar, dict, Series, or DataFrame
        Value to use to fill holes (e.g. 0), alternately a
        dict/Series/DataFrame of values specifying which value to use for
        each index (for a Series) or column (for a DataFrame). (values not
        in the dict/Series/DataFrame will not be filled). This value cannot
        be a list.
    method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
        Method to use for filling holes in reindexed Series
        pad / ffill: propagate last valid observation forward to next valid
        backfill / bfill: use NEXT valid observation to fill gap
    axis : {0 or 'index', 1 or 'columns'}
    inplace : boolean, default False
        If True, fill in place. Note: this will modify any
        other views on this object, (e.g. a no-copy slice for a column in a
        DataFrame).
    limit : int, default None
        If method is specified, this is the maximum number of consecutive
        NaN values to forward/backward fill. In other words, if there is
        a gap with more than this number of consecutive NaNs, it will only
        be partially filled. If method is not specified, this is the
        maximum number of entries along the entire axis where NaNs will be
        filled. Must be greater than 0 if not None.
    downcast : dict, default is None
        a dict of item->dtype of what to downcast if possible,
        or the string 'infer' which will try to downcast to an appropriate
        equal type (e.g. float64 to int64 if possible)

    Returns
    -------
    filled : DataFrame

    See Also
    --------
    interpolate : Fill NaN values using interpolation.
    reindex, asfreq

    Examples
    --------
    >>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
    ...                    [3, 4, np.nan, 1],
    ...                    [np.nan, np.nan, np.nan, 5],
    ...                    [np.nan, 3, np.nan, 4]],
    ...                    columns=list('ABCD'))
    >>> df
         A    B   C  D
    0  NaN  2.0 NaN  0
    1  3.0  4.0 NaN  1
    2  NaN  NaN NaN  5
    3  NaN  3.0 NaN  4

    Replace all NaN elements with 0s.

    >>> df.fillna(0)
        A   B   C   D
    0   0.0 2.0 0.0 0
    1   3.0 4.0 0.0 1
    2   0.0 0.0 0.0 5
    3   0.0 3.0 0.0 4

    We can also propagate non-null values forward or backward.

    >>> df.fillna(method='ffill')
        A   B   C   D
    0   NaN 2.0 NaN 0
    1   3.0 4.0 NaN 1
    2   3.0 4.0 NaN 5
    3   3.0 3.0 NaN 4

    Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
    2, and 3 respectively.

    >>> values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
    >>> df.fillna(value=values)
        A   B   C   D
    0   0.0 2.0 2.0 0
    1   3.0 4.0 2.0 1
    2   0.0 1.0 2.0 5
    3   0.0 3.0 2.0 4

    Only replace the first NaN element.

    >>> df.fillna(value=values, limit=1)
        A   B   C   D
    0   0.0 2.0 2.0 0
    1   3.0 4.0 NaN 1
    2   NaN 1.0 NaN 5
    3   NaN 3.0 NaN 4

In [70]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [71]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [72]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [75]:
pd.concat([df1,df2],axis=0)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [76]:
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [77]:
df3 = pd.DataFrame({'E': ['E0', 'E1', 'E2', 'E3'],
                        'F': ['F0', 'F1', 'F2', 'F3'],
                        'G': ['G0', 'G1', 'G2', 'G3'],
                        'H': ['H0', 'H1', 'H2', 'H3']},
                        index=[0, 1, 2, 3])
pd.concat([df1,df3],axis=1)

    A   B   C   D   E   F   G   H
0  A0  B0  C0  D0  E0  F0  G0  H0
1  A1  B1  C1  D1  E1  F1  G1  H1
2  A2  B2  C2  D2  E2  F2  G2  H2
3  A3  B3  C3  D3  E3  F3  G3  H3

In [78]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                          'C': ['C0', 'C1', 'C2', 'C4'],
                          'D': ['D0', 'D1', 'D2', 'D4']})

In [79]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [80]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C4  D4

In [81]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [82]:
pd.merge(left, right,how='outer', on=['key'])

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3  NaN  NaN
4  K4  NaN  NaN   C4   D4

In [83]:
pd.merge(left, right, how='right', on=['key'])

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K4  NaN  NaN  C4  D4

In [68]:
pd.merge(left, right, how='left', on=['key'])

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3  NaN  NaN

In [84]:
pd.merge(left, right, how='right', on=['key'])

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K4  NaN  NaN  C4  D4

In [85]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['L0', 'L1', 'L0', 'L1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['L0', 'L1', 'L0', 'L1'],
                         'C': ['C0', 'C1', 'C2', 'C3'],
                         'D': ['D0', 'D1', 'D2', 'D3']})

In [86]:
left

  key1 key2   A   B
0   K0   L0  A0  B0
1   K0   L1  A1  B1
2   K1   L0  A2  B2
3   K2   L1  A3  B3

In [87]:
right

  key1 key2   C   D
0   K0   L0  C0  D0
1   K1   L1  C1  D1
2   K1   L0  C2  D2
3   K2   L1  C3  D3

In [88]:
pd.merge(left, right,how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   L0  A0  B0  C0  D0
1   K1   L0  A2  B2  C2  D2
2   K2   L1  A3  B3  C3  D3

In [89]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [90]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [91]:
by_comp = df.groupby("Company")

In [92]:
by_comp

In [95]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [96]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [97]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [98]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [99]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [80]:
# Save and load

In [100]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [113]:
df.to_csv('example.csv',index=False)

In [114]:
df = pd.read_csv('example.csv')

In [115]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz